app/controllers/galleries_controller.rb

SELECT  "galleries".* FROM "galleries" WHERE "galleries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "paintings".* FROM "paintings" WHERE "paintings"."gallery_id" = $1  [["gallery_id", 1]]
---
  def show
    @gallery = Gallery.find(params[:id])
    @paintings = Painting.where(gallery_id: params[:id])

INSERT INTO "galleries" ("name", "city", "state", "zip", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @gallery = Gallery.new(params_strong)
    if @gallery.save