app/controllers/paintings_controller.rb

SELECT  "galleries".* FROM "galleries" WHERE "galleries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    @gallery = Gallery.find(params[:gallery_id])

SELECT  "galleries".* FROM "galleries" WHERE "galleries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @gallery = Gallery.find(params[:gallery_id])

SELECT  "galleries".* FROM "galleries" WHERE "galleries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "paintings" ("title", "year", "artist", "gallery_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Bob"], ["year", "1234"], ["artist", "HOBO"], ["gallery_id", 2], ["created_at", 2017-01-13 13:32:09 UTC], ["updated_at", 2017-01-13 13:32:09 UTC]]
---
  def create
   @gallery = Gallery.find(params[:gallery_id])
   @painting = Painting.new(params_strong)
   @painting.gallery = @gallery
   if @painting.save